Tekla.Structures.Model.Boolean
The Boolean class is an abstract base class for boolean operations such as a part cut, an add, a fitting or
a cut plane.

Tekla.Structures.Model.Boolean.Father
The father object of the boolean operation; the model object instance to operate on.

Tekla.Structures.Model.Boolean.#ctor
Constructs an empty boolean.